## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_s3_bucket_acl.archive_storage_acl will be created
  + resource "aws_s3_bucket_acl" "archive_storage_acl" {
      + acl    = "private"
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.reliability_file_storage_s3_acl will be created
  + resource "aws_s3_bucket_acl" "reliability_file_storage_s3_acl" {
      + acl    = "private"
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.vault_file_storage_acl will be created
  + resource "aws_s3_bucket_acl" "vault_file_storage_acl" {
      + acl    = "private"
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.lifecycle_rules_archive_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rules_archive_storage" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + id     = "lifecycle_archive_storage"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.lifecycle_rules_reliability_file_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rules_reliability_file_storage" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + id     = "lifecycle_reliability_file_storage"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.archive_storage_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "archive_storage_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.reliability_file_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "reliability_file_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.vault_file_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "vault_file_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.archive_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "archive_storage" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.reliability_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "reliability_file_storage" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.vault_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "vault_file_storage" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.vault_file_storage_versioning will be created
  + resource "aws_s3_bucket_versioning" "vault_file_storage_versioning" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

Error: reading ECS Task Definition (form-viewer): ClientException: Unable to describe task definition.

  with aws_ecs_task_definition.form_viewer,
  on ecs.tf line 56, in resource "aws_ecs_task_definition" "form_viewer":
  56: resource "aws_ecs_task_definition" "form_viewer" {

time=2023-09-15T20:20:09Z level=error msg=Terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/app/.terragrunt-cache/K54TG7zAX8DTTyqwBYHSG8Hho6I/-syjFrdAaB-6kNXhMmF1nXBOp7o/app prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/app] 
time=2023-09-15T20:20:09Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/app/.terragrunt-cache/K54TG7zAX8DTTyqwBYHSG8Hho6I/-syjFrdAaB-6kNXhMmF1nXBOp7o/app] exit status 1



```

</details>

